# CannotCreateGroupWithInvalidReferences Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotCreateGroupWithInvalidReferences Property
BuiltInFailures..::..GroupFailures Class See Also
---
The elements you have selected for grouping contain dimensions or tags which do not reference a common model group. No detail group has been created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateGroupWithInvalidReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateGroupWithInvalidReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateGroupWithInvalidReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace